Repository: PHOENIXCONTACT/MORYX-Framework
Catalog: src/Moryx.Maintenance/Localizations/Strings.*.resx
Languages: de, it

# BLOCK
source: Block Machine
de: Blockieren Sie die Maschine
it: Macchina a blocchi

# BLOCK_DESCRIPTION
source: Block/Stop the machine during maintenance. Note: To be used with MachineBreak
de: Blockieren/Stoppen Sie die Maschine während der Wartung. Hinweis: Zur Verwendung mit MachineBreak
it: Blocca/Arresta la macchina durante la manutenzione. Nota: da utilizzare con MachineBreak

source: Description
de: Beschreibung
it: Descrizione

# DUPLICATED_RESOURCE_EXCEPTION
source: A maintenance order already exist for the resource id '{0}'
de: Für die Ressourcen-ID '{0}' ist bereits ein Wartungsauftrag vorhanden.
it: Esiste già un ordine di manutenzione per l'ID risorsa '{0}'

# INSTRUCTIONS
source: Maintenance Instructions/manual
de: Wartungsanleitung/Handbuch
it: Istruzioni/manuale di manutenzione

source: Interval
de: Intervall
it: Intervallo

# INTERVAL_DESCRIPTION
source: Periodic time at which to perform a maintenance
de: Regelmäßiger Zeitpunkt für die Durchführung einer Wartung
it: Tempo periodico in cui eseguire una manutenzione

source: Is Active
de: Ist aktiv
it: È attivo

# IS_ACTIVE_DESCRIPTION
source: If false the maintenance for the resource will not be scheduled.
de: Wenn 'false', wird die Wartung für die Ressource nicht geplant.
it: Se falso, la manutenzione della risorsa non verrà pianificata.

# MAINTENANCE_FORM
source: Maintenance Schedule
de: Wartungsplan
it: Programma di manutenzione

# MAINTENANCE_NOT_FOUND_EXCEPTION
source: No Maintenance Order found for the given id '{0}'
de: Für die angegebene ID '{0}' wurde kein Wartungsauftrag gefunden.
it: Nessun ordine di manutenzione trovato per l'ID specificato '{0}'

source: Resource
de: Ressource
it: Risorsa

# RESOURCE_DESCRIPTION
source: Resource that will receive a maintenance
de: Ressource, die gewartet wird
it: Risorsa che riceverà una manutenzione
