Repository: PHOENIXCONTACT/MORYX-Framework
Catalog: src/Moryx.Drivers.Mqtt/Properties/Strings.*.resx
Languages: de

# MqttDriver_BrokerUrl
source: Host address
de: Host-Adresse

# MqttDriver_Password
source: Client password
de: Passwort

# MqttDriver_Password_Description
source: Password for authenticating with the MQTT broker
de: Passwort zur Authentifizierung beim MQTT-Broker

# MqttDriver_ReconnectWithoutCleanSession
source: Reconnect using a clean session
de: Neu verbinden mit sauberer Sitzung

# MqttDriver_ReconnectDelayMs
source: Delay between reconnection attempts
de: Verzögerung bei der Verbindungswiederherstellung

# MqttDriver_Identifier
source: Root MQTT topic
de: Wurzel-Thema

# MqttDriver_Username
source: Client username
de: Benutzername

# MqttDriver_Username_Description
source: Username for authenticating with the MQTT broker
de: Benutzername zur Authentifizierung beim MQTT-Broker

# MqttDriver_UseTls_Description
source: Check to enable a TLS secured connection
de: Aktivieren Sie diese Option für eine TLS-gesicherte TCP-Verbindung

# MqttDriver_UseTls
source: Use TLS
de: TLS aktivieren

# MqttDriver_QualityOfService_Description
source: Select the QoS level for message delivery
de: Qualitätsstufe des MQTT-Dienstes für gesendete Nachrichten

# MqttDriver_QualityOfService
source: Set MQTT quality of service level
de: MQTT-Dienstqualitätsebene

# MqttDriver_DriverState
source: Status of the MQTT driver
de: Treiberstatus

# MqttDriver_DisplayName
source: MQTT Broker
de: MQTT-Treiber

# MqttDriver_Description
source: A driver for connecting to MQTT resources
de: Ein Treiber, der eine Verbindung zu einer MQTT-Ressource herstellt

# MqttTopicIByteSerializable_Description
source: MQTT topic for messages implementing IByteSerializable
de: MQTT-Thema für Nachrichten, die IByte Serializable implementieren

# MqttTopicIByteSerializable_DisplayName
source: MQTT Broker for IByteSerializable messages
de: MQTT-Thema für Byte-Nachrichten

# MqttTopicIByteSerializable_MessageName
source: Name of message to be sent
de: Name der Nachricht

# MqttTopic_Identifier_Description
source: Identifier for MQTT topic, avoiding spaces and following MQTT best practices
de: Identifikation für MQTT-Thema. Vermeiden Sie Leerzeichen und befolgen Sie MQTT-Best Practices

source: MQTT Topic Identifier
de: MQTT-Thema-Identifikation

# MqttTopic_ResponseTopic
source: Topic for responses
de: Thema für Antworten

# MqttTopicPrimitive_DisplayName
source: MQTT Topic for primitive types
de: MQTT-Thema für primitive Datentypen

# MqttTopicPrimitive_Description
source: MQTT Topic where primitive data types are published
de: MQTT-Thema, auf dem primitive Datentypen veröffentlicht werden

# MqttTopicJson_DisplayName
source: MQTT Topic for JSON messages
de: MQTT-Thema für JSON-Nachrichten

# MqttTopicJson_Description
source: MQTT Topic where messages are in JSON format
de: MQTT-Thema, auf dem Nachrichten im JSON-Format bereitgestellt werden

# MqttTopicJson_Format
source: Message format
de: Nachrichtenformat

# MqttTopic_TopicType
source: Topic type
de: Topic Typ

# MqttTopic_TopicType_Description
source: Message flow direction
de: Nachrichtenfluss Richtung

# MqttTopicJson_EnumsAsStrings
source: Enums as string
de: Enums als Strings

# MqttTopicJson_EnumsAsStrings_Description
source: Controls enums are encoded as their string names or as numbers
de: Steuert ob Enums als Strings oder als Zahlen codiert werden

# MqttTopicJson_Serializer
source: Serializer
de: Serialisierer

# MqttTopicJson_Serializer_Description
source: Controls which serializer library to use
de: Steuert welche Serialisierungsbibliothek genutzt werden soll

# MqttDriver_TraceMessageContent_Name
source: Trace message content
de: Nachrichteninhalt aufzeichnen

# MqttDriver_TraceMessageContent_Description
source: Decides if the entire message content should be saved for debugging
de: Entscheidet ob der gesamte Nachrichten Inhalt gespeichert werden soll

# MqttDriver_Reconnect_Name
source: Reconnect
de: Neu verbinden

# MqttDriver_Reconnect_Description
source: Executes reconnect
de: Führt eine Neuverbindung aus

# MqttDriver_LastWillTopic_Description
source: The topic the last will message should be published to. Has no effect if HasLastWill is not set
de: Das Topic auf das die Last Will Nachricht veröffentlicht werden soll. Hat keinen Effekt, wenn HasLastWill nicht gesetzt ist

# MqttDriver_HasLastWill_Description
source: Decides if a last will message should be registered on the broker
de: Entscheidet, ob eine Last Will Nachricht registriert werden soll

# MqttDriver_HasLastWill
source: Has last will
de: Hat Last Will Nachricht
