Repository: PHOENIXCONTACT/MORYX-Framework
Catalog: src/Moryx.Orders.Management/Properties/Strings.*.resx
Languages: de, it, pl, zh

# OperationNotifications_AmountReachedNotificationMessage
source: Operation {0} has finished the last parts and is ready to report. Please report the produced parts.
pl: Operacja {0} zakończyła ostatnie części i jest gotowa do wylogowania. Prosimy o zgłoszenie wyprodukowanych części.

# OperationNotifications_AmountReachedNotificationTitle
source: Operation is ready to report
pl: Zamówienie jest gotowe do zgłoszenia

# RegexOperationValidation_Wrong_Amount
source: The operation amount must be bigger than zero.
de: Die zu produzierende Menge am Vorgang muss größer als Null sein.
it: La quantità dell'operazione deve essere maggiore di zero.
pl: Ilość operacji musi być większa niż zero.
zh: 操作数量必须大于零。

# RegexOperationValidation_Regex_Match_Failed
source: Operation number does not match regex: {0}.
de: Vorgangsnummer passt nicht zum hinterlegten Regex: {0}.
it: Il numero dell'operazione non corrisponde alla regex: {0}.
pl: Numer operacji nie pasuje do wyrażenia regularnego: {0}.
zh: 操作编号不符合正则表达式：{0}。

# RegexOperationValidation_No_Valid_Recipe
source: The operation has no valid recipe.
de: Der Vorgang hat kein valides Rezept.
it: L'operazione non ha una ricetta valida.
pl: Operacja nie ma ważnej receptury.
zh: 该操作没有有效的配方。

# RecipeAssignStep_WorkplanValidation_Failed
source: Workplan validation failed. Error: \n{0}
de: Arbeitsplanvalidierung fehlgeschlagen! Fehler: \n{0}
it: La validazione del piano di lavoro è fallita. Errore: \n{0}
pl: Walidacja planu pracy nie powiodła się. Błąd: \n{0}
zh: 工作计划验证失败。错误：\n{0}

# RecipeAssignStep_Selection_Failed
source: It was not possible to select recipes for the operation! There was a null value or no recipe selected!
de: Es war nicht möglich ein passendes Rezept für den Vorgang auszuwählen. Es wurde kein Rezept ausgewählt!
it: Non è stato possibile selezionare le ricette per l'operazione! C'era un valore nullo o nessuna ricetta selezionata!
pl: Nie można było wybrać receptur dla operacji! Wartość była pusta lub nie wybrano żadnej receptury!
zh: 无法为操作选择配方！存在空值或未选择任何配方！

# RecipeAssignStep_Restore_Failed
source: Failed to assign recipes. There should only be references.
de: Es war nicht möglich die Rezepte wiederherzustellen. Der Vorgang darf beim wiederherstellen nur Rezeptreferenzen haben.
it: Assegnazione delle ricette fallita. Dovrebbero esserci solo riferimenti.
pl: Nie udało się przypisać receptur. Powinny być tylko odniesienia.
zh: 无法分配配方，应该只有引用。

# RecipeAssignStep_Processing_Failed
source: It was not possible to process recipe '{0}' successfully!
de: Es war nicht möglich das Rezept '{0}' erfolgreich zu verarbeiten!
it: Non è stato possibile elaborare con successo la ricetta '{0}'!
pl: Nie udało się pomyślnie przetworzyć receptury '{0}'!
zh: 无法成功处理配方 '{0}'！

# ProductAssignStep_Selection_Failed
source: It was not possible to assign the product!
de: Es war nicht möglich das Produkt auszuwählen!
it: Non è stato possibile assegnare il prodotto!
pl: Nie udało się przypisać produktu!
zh: 无法分配该产品！

# OperationState_RunningState
source: Running
de: Laufend
it: In esecuzione
pl: W trakcie
zh: 运行中

# OperationState_ReadyState
source: Ready
de: Bereit
it: Pronto
pl: Gotowy
zh: 准备就绪

# OperationState_ReadyAssignState
source: Assigning
de: Zuweisen
it: Assegnazione in corso
pl: Przypisywanie
zh: 正在分配

# OperationState_InterruptedAssignState
source: Assigning
de: Zuweisen
it: Assegnazione in corso
pl: Przypisywanie
zh: 正在分配

# OperationState_AmountReachedAssignState
source: Assigning
de: Zuweisen
it: Assegnazione in corso
pl: Przypisywanie
zh: 正在分配

# OperationState_ReadyAssignFailedState
source: Assigning failed
de: Zuweisen fehlgeschlagen
it: Assegnazione fallita
pl: Przypisywanie nie powiodło się
zh: 分配失败

# OperationState_InterruptedAssignFailedState
source: Assigning failed
de: Zuweisen fehlgeschlagen
it: Assegnazione fallita
pl: Przypisywanie nie powiodło się
zh: 分配失败

# OperationState_AmountReachedAssignFailedState
source: Assigning failed
de: Zuweisen fehlgeschlagen
it: Assegnazione fallita
pl: Przypisywanie nie powiodło się
zh: 分配失败

# OperationState_InterruptingState
source: Interrupting
de: Unterbrechen
it: Interruzione in corso
pl: Przerywanie
zh: 中断中

# OperationState_InterruptedState
source: Interrupted
de: Unterbrochen
it: Interrotto
pl: Przerwane
zh: 中断

# OperationState_InitialState
source: Initial
it: Iniziale
pl: Początkowy
zh: 初始的

# OperationState_InitialAssignState
source: Creating
de: Erstellen
it: Creazione in corso
pl: Tworzenie
zh: 正在创建

# OperationState_InitialAssignFailedState
source: Creation Failed
de: Erstellung fehlgeschlagen
it: Creazione fallita
pl: Tworzenie nie powiodło się
zh: 创建失败

# OperationState_CompletedState
source: Completed
de: Abgeschlossen
it: Completato
pl: Zakończone
zh: 已完成

# OperationState_AmountReachedState
source: Amount Reached
de: Menge erreicht
it: Quantità raggiunta
pl: Osiągnięta ilość
zh: 达到数量上限

# OperationState_AbortedState
source: Aborted
de: Abgebrochen
it: Annullato
pl: Przerwane
zh: 已中止

# OperationManager_StateErrorText
source: Operation in this state cannot be started.
de: Vorgang in diesem Status kann nicht gestartet werden.
it: L'operazione in questo stato non può essere avviata.
pl: Operacji w tym stanie nie można rozpocząć.
zh: 无法启动处于此状态的操作。

# OperationManager_NoReportErrorText
source: No report possible in the current operation state.
de: Keine Rückmeldung beim aktuellen Vorgangsstatus möglich.
it: Nessun rapporto possibile nello stato attuale dell'operazione.
pl: Raportowanie nie jest możliwe w obecnym stanie operacji.
zh: 在当前操作状态下无法进行报告。

# OperationManager_NoPartialReportErrorText
source: Partial report is not possible in the current operation state.
de: Teilrückmeldug ist beim aktuellen Vorgangsstatus nicht möglich.
it: Il rapporto parziale non è possibile nello stato attuale dell'operazione.
pl: Częściowe raportowanie nie jest możliwe w obecnym stanie operacji.
zh: 在当前操作状态下无法进行部分报告。

# OperationManager_NoFinalReportErrorText
source: Final report is not possible in the current operation state.
de: Endrückmeldung ist beim aktuellen Vorgangsstatus nicht möglich.
it: Il rapporto finale non è possibile nello stato attuale dell'operazione.
pl: Końcowe raportowanie nie jest możliwe w obecnym stanie operacji.
zh: 在当前操作状态下无法进行最终报告。

# OperationManager_MaxRunningErrorText
source: Maximum amount of running operations is reached.
de: Die maximale Anzahl laufender Vorgänge wurde erreicht.
it: È stato raggiunto il numero massimo di operazioni in esecuzione.
pl: Osiągnięto maksymalną liczbę operacji w trakcie.
zh: 已达到最大运行操作数量。

# OperationAssignment_Successful
source: Successful execution of operation assignment step {0}
de: Erfolgreiche Ausführung des Zuweisungsschritts {0}
it: Esecuzione riuscita del passaggio di assegnazione dell'operazione {0}
pl: Pomyślne wykonanie kroku przypisania operacji {0}
zh: 成功执行操作分配步骤 {0}

# OperationAssignment_Started
source: Starting operation assignment...
de: Starte Vorgangszuweisungen...
it: Avvio dell'assegnazione dell'operazione...
pl: Rozpoczynanie przypisania operacji...
zh: 开始操作分配...

# OperationAssignment_RecipeReassigned
source: Recipe {0} reassigned to operation
de: Rezept {0} wurde neu zugewiesen
it: Ricetta {0} riassegnata all'operazione
pl: Receptura {0} ponownie przypisana do operacji
zh: 配方 {0} 重新分配给操作

# OperationAssignment_Exception_Assign
source: Failed to assign operation
de: Fehler beim zuweisen des Vorgangs
it: Assegnazione dell'operazione fallita
pl: Nie udało się przypisać operacji
zh: 无法分配操作

# DocumentAssignStep_Restore_Documents_Failed
source: Unable to restore documents from FileSystem!
de: Wiederherstellen der Dokumente vom Dateisystem nicht möglich!
it: Impossibile ripristinare i documenti dal FileSystem!
pl: Nie można przywrócić dokumentów z systemu plików!
zh: 无法从文件系统中恢复文档！

# DocumentAssignStep_Documents_Loading_Failed
source: Error while loading document information from document provider!
de: Fehler beim Laden der Dokumente!
it: Errore durante il caricamento delle informazioni del documento dal fornitore di documenti!
pl: Błąd podczas ładowania informacji o dokumencie od dostawcy dokumentów!
zh: 从文档提供程序加载文档信息时出现错误！

# DocumentAssignStep_Document_Loading_Failed
source: Error while loading document '{0}' from document provider!
de: Fehler beim laden des Dokumentes '{0}'!
it: Errore durante il caricamento del documento '{0}' dal fornitore di documenti!
pl: Błąd podczas ładowania dokumentu '{0}' od dostawcy dokumentów!
zh: 从文档提供程序加载文档 '{0}' 时出现错误！

# PartsAssignStep_Threw_Exception
source: {0} threw an exception when loading product parts
de: {0} hat einen Ausnahmefehler beim laden der Produktteile ausgelöst
it: {0} ha lanciato un'eccezione durante il caricamento di parti di prodotto
pl: {0} rzucił wyjątek podczas ładowania części produktu
zh: {0} 加载产品部件时出现异常

# PartsAssignStep_Failed
source: It was not possible to assign the product parts.
de: Es war nicht möglich, die Produktteile zuzuweisen.
it: Non è stato possibile assegnare le parti del prodotto.
pl: Nie było możliwe przypisanie części produktu.
zh: 无法分配产品部件。

# OperationManager_OverDeliveryNotice
source: Cannot reduce the target amount below number of successfully produced pieces.
de: Die Zielmenge kann nicht unter die Anzahl der erfolgreich produzierten Teile gesenkt werden.
it: Non è possibile ridurre l'obiettivo al di sotto del numero di pezzi prodotti con successo.
pl: Nie można zmniejszyć kwoty docelowej poniżej liczby pomyślnie wyprodukowanych sztuk.
zh: 不能将目标数量减至低于成功生产的件数。
